import"./modulepreload-polyfill-B5Qt9EMX.js";import{$ as p}from"./vendor-CeA792Xf.js";import{c as l}from"./client-C7Xh_emp.js";import{p as i}from"./news-CdsrJnaW.js";const o=[{date:1731370468e3,author:"hasanger",title:"规则",content:"玩 Suroi，即表示您同意遵守这些规则。否则将导致封禁，如下所述。",longContent:`
        <br>
        <h2>禁止黑客攻击！</h2>
        黑客攻击是指使用任何可能提供竞争优势的游戏修改或外部软件，包括但不限于：瞄准机器人、近战锁定、视觉辅助、ESP 和利用故障。
        <ul>
          <li>第一次违规：禁赛 30 天</li>
          <li>第二次违规：永久封禁</li>
        </ul>
        如果您发现漏洞或漏洞，请向管理员报告，或向 web@email.heheda.top 发送电子邮件。除非您滥用它或告诉其他人，否则您不会被禁止。

        <br><br>

        <h2>没有组队！</h2>
        组队定义为帮助其他不在您的团队中的玩家。<br>
        这可能包括不攻击他们、给他们物品、帮助他们杀死其他玩家以及发送积极的表情。
        <ul>
          <li>第一次违规：警告</li>
          <li>第二次违规：禁赛 24 小时</li>
          <li>第 3 次违规：禁赛 7 天</li>
          <li>第 4 次违规：永久封禁</li>
        </ul>
        与黑客合作将导致永久封禁。

<br><br>

<h2>没有不适当的用户名！</h2>
        禁止包含诽谤和其他仇恨语言的用户名。
        <ul>
          <li>第一次违规：警告</li>
          <li>第二次违规：禁赛 7 天</li>
          <li>第 3 次违规：永久封禁</li>
          <ul>
            <li>我们设置了过滤器来阻止某些单词。尝试使用特殊字符绕过这些过滤器将导致立即封禁。</li>
            <li>如果您使用宣传黑客攻击的名称，您将被永久禁止。</li>
          </ul>
        </ul>

<br>

<h2>VPN/代理策略</h2>
        为了使逃避禁令更加困难，VPN 和代理被阻止。如果您需要一个来玩游戏，您可以通过联系管理员或向 web@email.heheda.top 发送电子邮件来申请豁免。
        `},{date:169090823e4,author:"Katloo",title:"教程",content:"如果您是新玩家，请查看此教程以学习如何玩！",longContent:`<h2>控制</h2>
<p>移动 - WASD 或箭头键</p>
<p>目标 - 鼠标</p>
<p>攻击 - 左键单击</p>
<p>更改武器 - 1 到 4 或滚轮</p>
<p>拾取/战利品/互动/复活 - F</p>
<p>重新加载 - R</p>
<p>使用治疗项目 - 左键点击项目或 7 到 0</p>
<p>取消操作 - X</p>
<p>切换全屏地图 - G 或 M</p>
<p>切换 Minimap - N</p>
<p>使用表情轮 - 按住 右键单击、拖动并释放</p>
<p>团队 Ping - 按住 右键单击 和 C，拖动并释放</p>
<p>请求项目 - 按住 C 并单击项目</p>
<p>放置项 - 右键单击项</p>
<p>装备最后一件物品 - Q</p>
<p>交换枪槽 - T</p>
<p>装备其他枪 - 太空</p>
<p>更改范围缩放 - 左键单击范围</p>

<h3>可以在设置中更改键位！</h3>

<h2>怎么玩</h2>
<p>Suroi 的目标是成为最后一个站立的玩家。你一开始什么都没有，所以在地图上四处移动以获取武器、瞄准镜、盔甲、治疗物品和弹药。如果您看到其他玩家，请消灭他们以获取他们的战利品！</p>

<h2>橙色 = 差</h2>
<p>你还有另一个敌人需要提防：一种致命的橙色气体。随着游戏的进行，气体慢慢充满地图，使安全区越来越小。每次收缩时伤害都会增加。</p>

<h2>类似游戏</h2>
<p>如果您玩过 PUBG、Fortnite 和 Apex Legends 等游戏，或者 surviv.io 和 zombsroyale.io 等其他浏览器大逃杀游戏，您可能熟悉游戏的概念！</p>
`}];p(()=>{l("#splash-more"),p("#news-articles").html(o.map(i).join(""))});
